src/InformationRegisters/_PrintFormLogs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>_PrintFormLogs</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Result</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>TestID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/InventoryTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>InventoryTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NonInventory</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FederalIDType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FederalIDType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>USTaxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor1099</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Vendor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpenseAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Website</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Terms</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentTerms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StripeID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StripeToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ARAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceLevel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceLevels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>last4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>exp_month</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>exp_year</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewObject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DwollaID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF4String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF5String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF2Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF3Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF4Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF5Num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>bitcoin_address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesPeople</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Taxable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResaleNO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/_UnitTestsPrintForms/Ext/Module.bsl
&AtServer
Procedure SalesOrderTest1000() Export
	
	TestSO = Documents.SalesOrder.CreateDocument();
	TestCust = Catalogs.Companies.CreateItem();
	TestCust.Description = "test_customer1";
	TestCust.Customer = True;
	TestCust.Write();
	TestAddr = Catalogs.Addresses.CreateItem();
	TestAddr.Owner = TestCust.Ref;
	TestAddr.Description = "Primary";
	TestAddr.DefaultBilling = True;
	TestAddr.DefaultShipping = True;
	TestAddr.Write();
	TestSO.Company = TestCust.Ref;
	TestSO.Number = "code123test";
	TestSO.Date = CurrentSessionDate();
	TestSO.ShipTo = TestAddr.Ref;
	TestSO.BillTo = TestAddr.Ref;
	TestItem = Catalogs.Products.CreateItem();
	TestItem.Code = "test_item1";
	TestItem.Description = "test_item1";
	TestItem.Type = Enums.InventoryTypes.Inventory;
	TestItem.Write();
	line = TestSO.LineItems.Add();
	line.Product = TestItem.Ref;
	line.QtyUnits = 2;
	line.PriceUnits = 100;
	line.Taxable = False;
	TestSO.DocumentTotal = line.PriceUnits * line.QtyUnits;
	TestCurrency = Catalogs.Currencies.CreateItem();
	TestCurrency.Symbol = "$$$";
	TestCurrency.Description = "3dollars";
	TestCurrency.Write();
	TestSO.Currency = TestCurrency.Ref;
	TestSO.Write(DocumentWriteMode.Posting);
	
	spreadsheet = New SpreadsheetDocument;
	PrintData = PrintFormFunctions.PrintSO(spreadsheet,"",TestSO.Ref);
	
	
	TestID = "SOTEST_documentNumber";
	Status = "Fail";
	
	Try
		If PrintData.Get("Number") = TestSO.Number Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SOTEST_billName";
	Status = "Fail";
	
	Try
		If PrintData.Get("ThemBill_ThemName") = TestSO.BillTo.Owner.Description Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SOTEST_shipzip";
	Status = "Fail";
	
	Try
		If PrintData.Get("ThemShip_ThemShipZIP") = TestSO.ShipTo.ZIP Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SOTEST_currency";
	Status = "Fail";
	
	Try
		If PrintData.Get("Currency") = TestSO.Currency.Symbol Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SOTEST_Total";
	Status = "Fail";
	
	Try
		If PrintData.Get("Total") = TestSO.Currency.Symbol + String(Format(TestSO.DocumentTotal, "NFD=2; NZ=")) Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();

EndProcedure

&AtServer
Procedure SalesInvoiceTest1000() Export
	
	TestSI = Documents.SalesInvoice.CreateDocument();
	TestCust = Catalogs.Companies.CreateItem();
	TestCust.Description = "test_customer2";
	TestCust.Customer = True;
	TestCust.Write();
	TestAddr = Catalogs.Addresses.CreateItem();
	TestAddr.Owner = TestCust.Ref;
	TestAddr.Description = "Primary";
	TestAddr.DefaultBilling = True;
	TestAddr.DefaultShipping = True;
	TestAddr.City = "San Francisco";
	TestAddr.AddressLine1 = "123 some road Dr.";
	TestAddr.Write();
	TestSI.Company = TestCust.Ref;
	TestSI.Number = "abc123";
	TestSI.Date = CurrentSessionDate();
	TestSI.ShipTo = TestAddr.Ref;
	TestSI.BillTo = TestAddr.Ref;
	TestItem = Catalogs.Products.CreateItem();
	TestItem.Code = "test_item2";
	TestItem.Description = "test_item2";
	TestItem.Type = Enums.InventoryTypes.NonInventory;
	TestItem.Write();
	line = TestSI.LineItems.Add();
	line.Product = TestItem.Ref;
	line.QtyUnits = 18;
	line.PriceUnits = 11.50;
	line.Taxable = False;
	TestSI.LineSubtotal = line.PriceUnits * line.QtyUnits;
	TestCurrency = Catalogs.Currencies.CreateItem();
	TestCurrency.Symbol = "Q";
	TestCurrency.Description = "Quollas";
	TestCurrency.Write();
	TestSI.Currency = TestCurrency.Ref;
	getARAccount = New Query("SELECT
	                         |	ChartOfAccounts.Ref
							 |FROM
	                         |	ChartOfAccounts.ChartOfAccounts AS ChartOfAccounts
	                         |WHERE
	                         |	ChartOfAccounts.Code = &Code");
	getARAccount.SetParameter("Code","1200");
	ARobject = getARAccount.Execute().Unload();

	TestSI.ARAccount = ARobject[0].Ref;
	TestSI.Write();
	
	spreadsheet = New SpreadsheetDocument;
	PrintData = PrintFormFunctions.PrintSI(spreadsheet,"",TestSI.Ref);
	
	
	TestID = "SITEST_documentNumber";
	Status = "Fail";
	
	Try
		If PrintData.Get("Number") = TestSI.Number Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SITEST_billline1";
	Status = "Fail";
	
	Try
		If PrintData.Get("ThemBill_Line1") = TestSI.BillTo.AddressLine1 Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SITEST_shipcity";
	Status = "Fail";
	
	Try
		If PrintData.Get("ThemShip_City") = TestSI.ShipTo.City Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();
	
	TestID = "SITEST_currency";
	Status = "Fail";
	
	Try
		If PrintData.Get("Currency") = TestSI.Currency.Symbol Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;                                                   
	Reg.Write();
	
	TestID = "SITEST_Total";
	Status = "Fail";
	
	Try
		If PrintData.Get("LineSubtotal") = TestSI.Currency.Symbol + String(Format(TestSI.LineSubtotal, "NFD=2; NZ=")) Then
			Status = "Pass";
		EndIf;
	Except
	EndTry;
	
	Reg = InformationRegisters._PrintFormLogs.CreateRecordManager();
	Reg.Period = CurrentSessionDate();
	Reg.TestID = TestID;
	Reg.Result = Status;
	Reg.Write();

EndProcedure
